In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('titanic.csv')

In [ ]:
#eda
print(df.shape)
print(df.isnull().sum())
# df.head

In [3]:
#이상치 IQR을 활용해 FARE 칼럼의 이상치를 찾고, 이상치 데이터의 여성수를 구하라
#iqr 구하기
q1 = np.percentile(df.fare,25)
q3 = np.percentile(df.fare,75)
iqr = q3 - q1
q1 - 1.5* iqr, q3 + 1.5*iqr

(-26.724, 65.6344)

In [4]:
#이상치 데이터 구하기
out1 = df[df.fare < (q1 - 1.5* iqr)]
out2 = df[df.fare > (q3 + 1.5* iqr)]
len(out1),len(out2)

(0, 116)

In [5]:
#이상치 데이터에서 여성 수 구하기, 
print(sum(out2.sex == 'female'))

70


올림 np.ceil()
내림 np.floor()
버림 np.trunc() / 음수에서 -5.5 버림을 하면 -5, 내림을 하면 -6

In [10]:
#이상치(소수점 나이)를 찾고 올림, 내림, 버림했을 때 3가지 모두 이상치 AGE 평균을 구한 다음 모두 더하여 출력
import pandas as pd
import numpy as np

df = pd.read_csv('basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [11]:
#소수점 데이터 찾기
df = df[(df.age - np.floor(df.age))!=0]
df

      id   age city    f1  f2   f3    f4         f5
6   id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378
8   id09   3.3   서울  35.0   2  NaN  ESFJ  17.252986
21  id22  -6.3   부산  72.0   1  NaN  ENFP  52.667078
28  id29 -13.5   부산  47.0   2  NaN  ENTP  67.886373
46  id47  34.6   대구  75.0   1  NaN  ESTJ  90.496999
64  id65  26.5   경기   NaN   0  NaN  ISFP  91.297791
84  id85  83.6   경기  55.0   0  NaN  INFJ  80.138280
92  id93  21.8   경기  57.0   0  NaN  ISFP  73.586397

In [13]:
#올림, 내림, 버림 평균값
ceil = np.ceil(df.age).mean()
floor = np.floor(df.age).mean()
trunc = np.trunc(df.age).mean()
ceil, floor, trunc

(23.75, 22.75, 23.0)

mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm

In [11]:
# 결측치가 80%이상 되는 컬럼은(변수는) 삭제하고, 80% 미만인 결측치가 있는 컬럼은 'city'별 중앙값으로 값을 대체하고 
# 'f1'컬럼의 평균값을 출력하세요!

import pandas as pd
import numpy as np

df = pd.read_csv('basic1.csv')
df.shape

(100, 8)

In [2]:
#결측치 확인
df.isnull().sum()

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

In [4]:
#결측치 80% 이상 삭제

print("삭제 전:", df.shape)
df = df.drop(['f3'], axis=1)
print("삭제 후:", df.shape)

# 결측치가 있는 컬럼을 제거하는 2가지 방법
# df.drop(['B', 'C'], axis=1)
# df.drop(columns=['B', 'C'])

삭제 전: (100, 8)
삭제 후: (100, 7)

In [7]:
# 도시별 중앙값 계산
print(df.city.unique())
s=df[df['city']=='서울']['f1'].median()
k=df[df['city']=='경기']['f1'].median()
b=df[df['city']=='부산']['f1'].median()
d=df[df['city']=='대구']['f1'].median()
s, k, b, d

['서울' '부산' '대구' '경기']

(68.0, 58.0, 62.0, 75.0)

In [8]:
df.head()

     id   age city    f1  f2    f4         f5
0  id01   2.0   서울   NaN   0  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  INFP  52.667078
4  id05  24.0   서울  85.0   2  ISFJ  29.269869

In [9]:
# f1결측치 city별 중앙값으로 대체 - fillna
df['f1'] = df['f1'].fillna(df['city'].map({'서울':s,'경기':k,'부산':b,'대구':d}))

# 만약 그냥 f1 중앙값으로 대체 한다면 
# df['f1'] = df['f1'].fillna(df['f1'].median())

print(df['f1'].mean())

65.52

In [4]:
df[df.f4 =='ESFJ']

      id   age city    f1  f2   f3    f4         f5
8   id09   3.3   서울  35.0   2  NaN  ESFJ  17.252986
12  id13  15.0   서울  68.0   0  NaN  ESFJ  83.685380
30  id31  86.0   부산  77.0   0  NaN  ESFJ  73.586397
58  id59  64.0   대구   NaN   1  NaN  ESFJ  20.129444
98  id99   1.0   경기  47.0   0  NaN  ESFJ  97.381034

In [5]:
df.f4 = df.f4.replace('ESFJ', 'ISFJ')
df[df.f4 =='ESFJ']

Empty DataFrame
Columns: [id, age, city, f1, f2, f3, f4, f5]
Index: []

In [8]:
df[(df.f4=='ISFJ')&(df.city=='경기')]

      id   age city    f1  f2   f3    f4         f5
62  id63  88.0   경기  86.0   1  NaN  ISFJ  73.586397
66  id67  66.0   경기  52.0   1  NaN  ISFJ  73.586397
72  id73  90.0   경기   NaN   1  NaN  ISFJ  73.586397
80  id81  86.0   경기  50.0   1  NaN  ISFJ  37.113739
98  id99   1.0   경기  47.0   0  NaN  ISFJ  97.381034

In [9]:
df[(df.f4=='ISFJ')&(df.city=='경기')]['age'].max()

90.0

******************************************************

In [21]:
"""
데이터셋(basic1.csv)의 'f5' 컬럼을 기준으로 상위 10개의 데이터를 구하고,
'f5'컬럼 10개 중 최소값으로 데이터를 대체한 후,
'age'컬럼에서 80 이상인 데이터의'f5 컬럼 평균값 구하기
"""

import pandas as pd
import numpy as np

df = pd.read_csv('basic1.csv')
df = df.sort_values('f5',ascending=False) #정렬

f_min = df.f5[:10].min() #최소값
df.f5[:10] = f_min

print(df[df.age >= 80].f5.mean())

62.49774712521738

C:\Users\kim\.conda\envs\exam_cv2\lib\site-packages\ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [28]:
"""
데이터셋(basic1.csv)의 앞에서 순서대로 70% 데이터만 활용해서,
'f1'컬럼 결측치를 중앙값으로 채우기 전후의 표준편차를 구하고
두 표준편차 차이 계산하기
"""

import pandas as pd
import numpy as np

df = pd.read_csv('basic1.csv') #df.shape() 100,8
df = df[:70]
df.isnull().sum() #결측치 확인
std1 = np.std(df.f1)

med = df.f1.median()
df.f1 = df.f1.fillna(med) #결측치 채우기
df.isnull().sum()
std2 = np.std(df.f1)

print(std1-std2)

3.2094305565060814

In [33]:
"""
데이터셋(basic1.csv)의 'age'컬럼의 이상치를 더하시오!
단, 평균으로부터 '표준편차*1.5'를 벗어나는 영역을 이상치라고 판단함
"""

import pandas as pd
import numpy as np

df = pd.read_csv('basic1.csv') 

mean = df.age.mean()
std = np.std(df.age)*1.5
out1 = mean + std
out2 = mean - std

df[(df.age>out1)|(df.age<out2)]['age'].sum()

473.5

In [49]:
"""
주어진 데이터 중 basic1.csv에서 'f4'컬럼 값이 'ENFJ'와 'INFP'인 'f1'의 표준편차 차이를 절대값으로 구하시오
"""
import pandas as pd
import numpy as np

df = pd.read_csv('basic1.csv') 
enfj = np.std(df[df.f4=='ENFJ']['f1'])
infp = np.std(df[df.f4=='INFP']['f1'])

print(np.abs(enfj-infp))

3.90635864969501

In [67]:
"""
 'f1'컬럼 결측 데이터를 제거하고, 'city'와 'f2'을 기준으로 묶어 합계를 구하고, 
 'city가 경기이면서 f2가 0'인 조건에 만족하는 f1 값을 구하시오
"""
import pandas as pd
import numpy as np

df = pd.read_csv('basic1.csv') 
df = df.dropna(subset=['f1'])
df2 = df.groupby(['city','f2']).sum()
df2

           age     f1          f5
city f2
경기   0   720.4  833.0  943.944823
     1   696.0  670.0  657.241212
     2   239.0  311.0  362.300060
대구   0   387.0  527.0  183.199568
     1   217.6  235.0  241.333824
     2   140.0  211.0   79.667919
부산   0   331.0  389.0  284.371097
     1   188.7  315.0  299.270973
     2   -13.5   47.0   67.886373
서울   0   145.0  278.0  218.528577
     1   315.3  534.0  438.485010
     2    68.3  207.0  126.661135

In [72]:
print(df2.iloc[0]['f1'])
print(df2.iloc[3]['f1'])

833.0
527.0